# **PANDAS: INTRODUCTION**
> It is often said that 80% of data analysis is spent on the data cleaning and preparing data. To get a handle on the problem, this section focuses on a small, but important aspect of data manipulation and cleaning with Pandas.
## **Data Structures**
**There are two data structures are there in Pandas -**<br>
* **Series -** It is one-dimensional labeled array capable of holding any data type (integer, strings, floating point numbers, Python objects etc.) of data. The axis is collectively referred to as index.

* **Data Frame -** It is a two-dimensional labeled data structure with columns of potentially different types. You can think of it like a spreadsheet or SQL Table or a Series of objects.

## **Series Data Structure:**
**pandas.core.series.Series(data, index, dtype, copy)**<br>
* **data -** data takes various forms like ndarray, list, constants, dictionary etc.<br>
* **index -** it is unique and hashable for easy identification.<br>
* **dtype -** it is for data type.<br>
* **copy -** copy data, and its default value is False. It only affects for Series or one dimensional ndarray inputs.

In [1]:
# importing required modules
import pandas as pd
import numpy as np

In [2]:
# creating empty Series
import warnings
warnings.filterwarnings('ignore')
s = pd.Series()
print (s, type(s))

Series([], dtype: float64) <class 'pandas.core.series.Series'>

In [3]:
# create a Series from a ndarray
arr_data = np.array(['apple', 'banana', 'cherry', 'pineapple'])
print (arr_data, type(arr_data))
s = pd.Series(data = arr_data)
print (s)
print (type(s), s[0], s[3])

['apple' 'banana' 'cherry' 'pineapple'] <class 'numpy.ndarray'>
0        apple
1       banana
2       cherry
3    pineapple
dtype: object
<class 'pandas.core.series.Series'> apple pineapple

In [4]:
arr_data = np.array([100, 300, 200, 600, 500])
s = pd.Series(data = arr_data, copy = False)
print (arr_data)
print (s)
s[0] = 999; arr_data[2] = 888
print (arr_data)
print (s)

[100 300 200 600 500]
0    100
1    300
2    200
3    600
4    500
dtype: int32
[999 300 888 600 500]
0    999
1    300
2    888
3    600
4    500
dtype: int32

In [5]:
arr_data = np.array([100, 300, 200, 600, 500])
s = pd.Series(data = arr_data, copy = True)
print (arr_data)
print (s)
s[0] = 999; arr_data[2] = 888
print (arr_data)
print (s)

[100 300 200 600 500]
0    100
1    300
2    200
3    600
4    500
dtype: int32
[100 300 888 600 500]
0    999
1    300
2    200
3    600
4    500
dtype: int32

In [6]:
arr_data = np.array(['apple', 'banana', 'cherry', 'pineapple'])
print (arr_data, type(arr_data))
s = pd.Series(data = arr_data)
print (s)
s = pd.Series(data = arr_data, index = [100, 101, 102, 103])
print (s)
print (s[100], type(s[100]), s[103], type(s[103]))

['apple' 'banana' 'cherry' 'pineapple'] <class 'numpy.ndarray'>
0        apple
1       banana
2       cherry
3    pineapple
dtype: object
100        apple
101       banana
102       cherry
103    pineapple
dtype: object
apple <class 'str'> pineapple <class 'str'>

In [7]:
arr_data = np.array(['apple', 'banana', 'cherry', 'pineapple'])
print (arr_data, type(arr_data))
s = pd.Series(data = arr_data, index = [100, 101, 100, 103])
print (s)
print (s[100], type(s[100]), s[103], type(s[103]))
s[100] = 'lemon'
print (s)
print (s[100])

['apple' 'banana' 'cherry' 'pineapple'] <class 'numpy.ndarray'>
100        apple
101       banana
100       cherry
103    pineapple
dtype: object
100     apple
100    cherry
dtype: object <class 'pandas.core.series.Series'> pineapple <class 'str'>
100        lemon
101       banana
100        lemon
103    pineapple
dtype: object
100    lemon
100    lemon
dtype: object

In [8]:
arr_data = np.array(['apple', 'banana', 'cherry', 'pineapple'])
print (arr_data)
s = pd.Series(data = arr_data, index = ['fruit-1', 'fruit-2', 'fruit-3', 'fruit-4'])
print (s)
print (s['fruit-1'], s[0], s['fruit-3'], s[2])

['apple' 'banana' 'cherry' 'pineapple']
fruit-1        apple
fruit-2       banana
fruit-3       cherry
fruit-4    pineapple
dtype: object
apple apple cherry cherry

In [9]:
# create a Series from a dictionary
dict_data = {'apple':100, 'banana':202, 'coconut':450, 'mango':435}
print (dict_data)
s = pd.Series(data = dict_data)
print (s)
s = pd.Series(dict_data, index = ['banana', 'mango', 'apple', 'coconut'])

{'apple': 100, 'banana': 202, 'coconut': 450, 'mango': 435}
apple      100
banana     202
coconut    450
mango      435
dtype: int64

In [10]:
dict_data = {'apple':100, 'banana':202, 'coconut':450, 'mango':435}
s = pd.Series(dict_data, index = ['banana', 'mango', 'apple', 'coconut'])
print (s)
s = pd.Series(data = dict_data, index = ['banana', 'lime', 'coconut', 'mango', 
                                         'guava', 'apple', 'mango', 'apple', 'coconut'])
print (s)
print (s['banana'], s['lime'], s[4], s[5])

banana     202
mango      435
apple      100
coconut    450
dtype: int64
banana     202.0
lime         NaN
coconut    450.0
mango      435.0
guava        NaN
apple      100.0
mango      435.0
apple      100.0
coconut    450.0
dtype: float64
202.0 nan nan 100.0

In [11]:
# create a Series from a scalar
s = pd.Series(data = 5, index = [0, 1, 2, 3, 4])
print (s)
s = pd.Series(5, index = [0, 1, 2, 0, 1, 2])
print (s)

0    5
1    5
2    5
3    5
4    5
dtype: int64
0    5
1    5
2    5
0    5
1    5
2    5
dtype: int64

In [12]:
# Create a Series from a list
s = pd.Series(data = [101, 303, 202, 404, 505], index = ['red', 'blue', 'brown', 'black', 'silver'])
print (s)
print (s['blue'], s[1])
print (s[0:4])
print (s[-5:-1])
print (s[['brown', 'red', 'silver', 'blue']])

red       101
blue      303
brown     202
black     404
silver    505
dtype: int64
303 303
red      101
blue     303
brown    202
black    404
dtype: int64
red      101
blue     303
brown    202
black    404
dtype: int64
brown     202
red       101
silver    505
blue      303
dtype: int64

In [13]:
print (s)
print (s.sort_values())
print (s.sort_index())

red       101
blue      303
brown     202
black     404
silver    505
dtype: int64
red       101
brown     202
blue      303
black     404
silver    505
dtype: int64
black     404
blue      303
brown     202
red       101
silver    505
dtype: int64

In [14]:
print (s)
print (s.argmin(), s.argmax(), s.count(), len(s))

red       101
blue      303
brown     202
black     404
silver    505
dtype: int64
0 4 5 5

## **Data Frame Data Structure:**

## **Create DataFrame**

In [15]:
data_dict = {'emp_name':['Amal', 'Kamal', 'Bimal', 'Shyamal'], 'emp_age':[34, 35, 45, 43]}
emp_id = [100, 101, 102, 103]
df = pd.DataFrame(data = data_dict)
df

  emp_name  emp_age
0     Amal       34
1    Kamal       35
2    Bimal       45
3  Shyamal       43

In [16]:
data_dict = {'emp_name':['Amal', 'Kamal', 'Bimal', 'Shyamal'], 'emp_age':[34, 35, 45, 43]}
emp_id = [100, 101, 102, 103]
df = pd.DataFrame(data = data_dict, index = emp_id)
print (df)
df

    emp_name  emp_age
100     Amal       34
101    Kamal       35
102    Bimal       45
103  Shyamal       43

    emp_name  emp_age
100     Amal       34
101    Kamal       35
102    Bimal       45
103  Shyamal       43

In [17]:
data_dict = {'emp_name':['Amal', 'Kamal', 'Bimal', 'Shyamal'], 'emp_age':[34, 35, 45, 43]}
emp_id = [100, 101, 102, 103]
df = pd.DataFrame(data = data_dict, index = emp_id)
df = df.reset_index()
df

   index emp_name  emp_age
0    100     Amal       34
1    101    Kamal       35
2    102    Bimal       45
3    103  Shyamal       43

In [18]:
data_dict = {'emp_name':['Amal', 'Kamal', 'Bimal', 'Shyamal'], 'emp_age':[34, 35, 45, 43]}
emp_id = [100, 101, 102, 103]
df = pd.DataFrame(data = data_dict, index = emp_id)
df.reset_index(inplace = True)
df

   index emp_name  emp_age
0    100     Amal       34
1    101    Kamal       35
2    102    Bimal       45
3    103  Shyamal       43

## **Creating three users: user1, user2 and user3**

In [19]:
user_data = [['alice', 19, 'F', 'student'], ['john', 26, 'M', 'student']]
user_columns = ['name', 'age', 'gender', 'job']
user1 = pd.DataFrame(data = user_data, columns = user_columns)
user1

    name  age gender      job
0  alice   19      F  student
1   john   26      M  student

In [20]:
user_data = dict(name = ['eric', 'paul'], age = [22, 58], gender = ['M', 'F'], job = ['student', 'manager'])
print (user_data)
user2 = pd.DataFrame(data = user_data)
user2

{'name': ['eric', 'paul'], 'age': [22, 58], 'gender': ['M', 'F'], 'job': ['student', 'manager']}

   name  age gender      job
0  eric   22      M  student
1  paul   58      F  manager

In [21]:
user_data = {'name': ['peter', 'julie'], 'age': [33, 44], 'gender': ['M', 'F'], 'job': ['engineer', 'scientist']}
user3 = pd.DataFrame(data = user_data)
user3

    name  age gender        job
0  peter   33      M   engineer
1  julie   44      F  scientist

## **Concatenation of DataFrames**

In [22]:
users = user1.append(user2)
users

    name  age gender      job
0  alice   19      F  student
1   john   26      M  student
0   eric   22      M  student
1   paul   58      F  manager

In [23]:
users = user1.append(user2, ignore_index=True)
users

    name  age gender      job
0  alice   19      F  student
1   john   26      M  student
2   eric   22      M  student
3   paul   58      F  manager

In [24]:
users = users.append(user3, ignore_index=True)
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [25]:
users = user1.append(user2).append(user3, ignore_index = True)
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [26]:
users = pd.concat([user1, user2, user3])
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
0   eric   22      M    student
1   paul   58      F    manager
0  peter   33      M   engineer
1  julie   44      F  scientist

In [27]:
users = pd.concat([user1, user2, user3], ignore_index = True)
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

## **DataFrame to NumPy ndarray**

In [28]:
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [29]:
arr_data = users[['name', 'job']].to_numpy()
print (arr_data, type(arr_data), arr_data.shape)

[['alice' 'student']
 ['john' 'student']
 ['eric' 'student']
 ['paul' 'manager']
 ['peter' 'engineer']
 ['julie' 'scientist']] <class 'numpy.ndarray'> (6, 2)

In [30]:
arr_data = users.to_numpy()
print (arr_data, type(arr_data), arr_data.shape)

[['alice' 19 'F' 'student']
 ['john' 26 'M' 'student']
 ['eric' 22 'M' 'student']
 ['paul' 58 'F' 'manager']
 ['peter' 33 'M' 'engineer']
 ['julie' 44 'F' 'scientist']] <class 'numpy.ndarray'> (6, 4)

In [31]:
arr_data = np.array(users)
print (arr_data, type(arr_data), arr_data.shape)

[['alice' 19 'F' 'student']
 ['john' 26 'M' 'student']
 ['eric' 22 'M' 'student']
 ['paul' 58 'F' 'manager']
 ['peter' 33 'M' 'engineer']
 ['julie' 44 'F' 'scientist']] <class 'numpy.ndarray'> (6, 4)

## **Join DataFrame**

In [32]:
dict_data = dict(name = ['alice', 'john', 'eric', 'julie', 'cathy'], height = [165, 180, 175, 171, 169])
user4 = pd.DataFrame(data = dict_data)
user4

    name  height
0  alice     165
1   john     180
2   eric     175
3  julie     171
4  cathy     169

In [33]:
users = pd.concat([user1, user2, user3], ignore_index=True)
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [34]:
# inner join: All common rows from both data frames
merge_inner = pd.merge(users, user4, on = "name", how = "inner")
merge_inner

    name  age gender        job  height
0  alice   19      F    student     165
1   john   26      M    student     180
2   eric   22      M    student     175
3  julie   44      F  scientist     171

In [35]:
merge_inner = pd.merge(users, user4, on = "name")
merge_inner        # by default inner join will take place

    name  age gender        job  height
0  alice   19      F    student     165
1   john   26      M    student     180
2   eric   22      M    student     175
3  julie   44      F  scientist     171

In [36]:
# outer join: All rows from both data frames
merge_outer = pd.merge(users, user4, on = "name", how = "outer")
merge_outer

    name   age gender        job  height
0  alice  19.0      F    student   165.0
1   john  26.0      M    student   180.0
2   eric  22.0      M    student   175.0
3   paul  58.0      F    manager     NaN
4  peter  33.0      M   engineer     NaN
5  julie  44.0      F  scientist   171.0
6  cathy   NaN    NaN        NaN   169.0

In [37]:
# left outer join: All rows from the left data frame and matching rows from the right data frame
merge_left = pd.merge(users, user4, on = "name", how = "left")
merge_left

    name  age gender        job  height
0  alice   19      F    student   165.0
1   john   26      M    student   180.0
2   eric   22      M    student   175.0
3   paul   58      F    manager     NaN
4  peter   33      M   engineer     NaN
5  julie   44      F  scientist   171.0

In [38]:
# right outer join: Only matching rows from the left data frame and all rows from the right data frame
merge_right = pd.merge(users, user4, on = "name", how = "right")
merge_right

    name   age gender        job  height
0  alice  19.0      F    student     165
1   john  26.0      M    student     180
2   eric  22.0      M    student     175
3  julie  44.0      F  scientist     171
4  cathy   NaN    NaN        NaN     169

## **Summarizing**

In [39]:
users = pd.concat([user1, user2, user3], ignore_index=True)
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [40]:
print (type(users))
users.head()

<class 'pandas.core.frame.DataFrame'>

    name  age gender       job
0  alice   19      F   student
1   john   26      M   student
2   eric   22      M   student
3   paul   58      F   manager
4  peter   33      M  engineer

In [41]:
users.head(3)

    name  age gender      job
0  alice   19      F  student
1   john   26      M  student
2   eric   22      M  student

In [42]:
users.tail()

    name  age gender        job
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [43]:
users.tail(3)

    name  age gender        job
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [44]:
users.any()

name      True
age       True
gender    True
job       True
dtype: bool

In [45]:
users.sample()

    name  age gender       job
4  peter   33      M  engineer

In [46]:
users.sample(3)

    name  age gender       job
2   eric   22      M   student
3   paul   58      F   manager
4  peter   33      M  engineer

In [47]:
print (users.index)
print (users.columns)

RangeIndex(start=0, stop=6, step=1)
Index(['name', 'age', 'gender', 'job'], dtype='object')

In [48]:
print (users.dtypes)
print (type(users.dtypes))

name      object
age        int64
gender    object
job       object
dtype: object
<class 'pandas.core.series.Series'>

In [49]:
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [50]:
print (users.shape)
print (f"So the Row# = {users.shape[0]} and Col# = {users.shape[1]}")
print (users.values)
print (type(users.values), users.values.ndim, users.values.shape, users.values.size)

(6, 4)
So the Row# = 6 and Col# = 4
[['alice' 19 'F' 'student']
 ['john' 26 'M' 'student']
 ['eric' 22 'M' 'student']
 ['paul' 58 'F' 'manager']
 ['peter' 33 'M' 'engineer']
 ['julie' 44 'F' 'scientist']]
<class 'numpy.ndarray'> 2 (6, 4) 24

In [51]:
print (users.job.value_counts())
print (users.gender.value_counts())
print (type(users.gender.value_counts()))

student      3
manager      1
engineer     1
scientist    1
Name: job, dtype: int64
F    3
M    3
Name: gender, dtype: int64
<class 'pandas.core.series.Series'>

In [52]:
users.describe()

             age
count   6.000000
mean   33.666667
std    14.895189
min    19.000000
25%    23.000000
50%    29.500000
75%    41.250000
max    58.000000

In [53]:
users.describe().transpose()

     count       mean        std   min   25%   50%    75%   max
age    6.0  33.666667  14.895189  19.0  23.0  29.5  41.25  58.0

In [54]:
users.describe().T

     count       mean        std   min   25%   50%    75%   max
age    6.0  33.666667  14.895189  19.0  23.0  29.5  41.25  58.0

In [55]:
users.describe(include=['object'])

         name gender      job
count       6      6        6
unique      6      2        4
top     alice      F  student
freq        1      3        3

In [56]:
users.describe(include=['object']).transpose()

       count unique      top freq
name       6      6    alice    1
gender     6      2        F    3
job        6      4  student    3

In [57]:
users.describe(include='all')

         name        age gender      job
count       6   6.000000      6        6
unique      6        NaN      2        4
top     alice        NaN      F  student
freq        1        NaN      3        3
mean      NaN  33.666667    NaN      NaN
std       NaN  14.895189    NaN      NaN
min       NaN  19.000000    NaN      NaN
25%       NaN  23.000000    NaN      NaN
50%       NaN  29.500000    NaN      NaN
75%       NaN  41.250000    NaN      NaN
max       NaN  58.000000    NaN      NaN

In [58]:
users.describe(include='all').T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
name,6,6,alice,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN
age,6.0,NaN,NaN,NaN,33.666667,14.895189,19.0,23.0,29.5,41.25,58.0
gender,6,2,F,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN
job,6,4,student,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [59]:
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   age     6 non-null      int64
 2   gender  6 non-null      object
 3   job     6 non-null      object
dtypes: int64(1), object(3)
memory usage: 320.0+ bytes

## **Column Selection**

In [60]:
users.job

0      student
1      student
2      student
3      manager
4     engineer
5    scientist
Name: job, dtype: object

In [61]:
users['job']

0      student
1      student
2      student
3      manager
4     engineer
5    scientist
Name: job, dtype: object

In [62]:
users[['job']]

         job
0    student
1    student
2    student
3    manager
4   engineer
5  scientist

In [63]:
users[['job', 'age']]

         job  age
0    student   19
1    student   26
2    student   22
3    manager   58
4   engineer   33
5  scientist   44

In [64]:
my_cols = ['age', 'job']
users[my_cols]

   age        job
0   19    student
1   26    student
2   22    student
3   58    manager
4   33   engineer
5   44  scientist

## **Row Selection**

In [65]:
df = users.copy()
df

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [66]:
print (df.iloc[3], type(df.iloc[3]))
print (df.loc[3], type(df.loc[3]))

name         paul
age            58
gender          F
job       manager
Name: 3, dtype: object <class 'pandas.core.series.Series'>
name         paul
age            58
gender          F
job       manager
Name: 3, dtype: object <class 'pandas.core.series.Series'>

In [67]:
df

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [68]:
print (df.iloc[4][3], df.iloc[4]['job'], df.loc[4][3], df.loc[4]['job'])
print (df.iloc[4, 3], df.iloc[4]['job'], df.loc[4][3], df.loc[4, 'job'])

engineer engineer engineer engineer
engineer engineer engineer engineer

In [69]:
print (df.shape, len(df), df.ndim, df.size)

(6, 4) 6 2 24

In [70]:
merge_outer

    name   age gender        job  height
0  alice  19.0      F    student   165.0
1   john  26.0      M    student   180.0
2   eric  22.0      M    student   175.0
3   paul  58.0      F    manager     NaN
4  peter  33.0      M   engineer     NaN
5  julie  44.0      F  scientist   171.0
6  cathy   NaN    NaN        NaN   169.0

In [71]:
print (merge_outer.shape, len(merge_outer), merge_outer.ndim, merge_outer.size)

(7, 5) 7 2 35

In [72]:
# increasing all age values by 100
df = users.copy()
print (df)
print ("Number of records:", df.shape[0])
for i in range(df.shape[0]):
    current_row = df.iloc[i]
    current_row.age += 100
    df.iloc[i] = current_row
df

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist
Number of records: 6

    name  age gender        job
0  alice  119      F    student
1   john  126      M    student
2   eric  122      M    student
3   paul  158      F    manager
4  peter  133      M   engineer
5  julie  144      F  scientist

## **Row Selection and Filtering**

In [73]:
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [74]:
users.age < 40

0     True
1     True
2     True
3    False
4     True
5    False
Name: age, dtype: bool

In [75]:
users[users.age < 40]

    name  age gender       job
0  alice   19      F   student
1   john   26      M   student
2   eric   22      M   student
4  peter   33      M  engineer

In [76]:
users[users.age < 40].job

0     student
1     student
2     student
4    engineer
Name: job, dtype: object

In [77]:
users[users.age < 40]['job']

0     student
1     student
2     student
4    engineer
Name: job, dtype: object

In [78]:
users[users.age < 40][['job', 'name']]

        job   name
0   student  alice
1   student   john
2   student   eric
4  engineer  peter

In [79]:
(users.age > 30) & (users.gender == 'F')

0    False
1    False
2    False
3     True
4    False
5     True
dtype: bool

In [80]:
users[(users.age > 30) & (users.gender == 'F')]

    name  age gender        job
3   paul   58      F    manager
5  julie   44      F  scientist

In [81]:
# SQL Query: select name, job, gender from users where age > 30 and gender = 'F';
users[(users.age > 30) & (users.gender == 'F')][['name', 'job', 'gender']]

    name        job gender
3   paul    manager      F
5  julie  scientist      F

In [82]:
users[(users.age > 30) | (users.gender == 'F')][['name', 'job', 'gender', 'age']]

    name        job gender  age
0  alice    student      F   19
3   paul    manager      F   58
4  peter   engineer      M   33
5  julie  scientist      F   44

In [83]:
users[(users.job == "engineer") | (users.job == 'student')][['name', 'job', 'gender', 'age']]

    name       job gender  age
0  alice   student      F   19
1   john   student      M   26
2   eric   student      M   22
4  peter  engineer      M   33

In [84]:
users[users.job.isin(["engineer", 'student'])][['name', 'job', 'gender', 'age']]

    name       job gender  age
0  alice   student      F   19
1   john   student      M   26
2   eric   student      M   22
4  peter  engineer      M   33

## **Sorting**

In [85]:
df = users.copy()
print (df)
df.age.sort_values()

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

0    19
2    22
1    26
4    33
5    44
3    58
Name: age, dtype: int64

In [86]:
df.sort_values(by = 'age')

    name  age gender        job
0  alice   19      F    student
2   eric   22      M    student
1   john   26      M    student
4  peter   33      M   engineer
5  julie   44      F  scientist
3   paul   58      F    manager

In [87]:
df = df.sort_values(by = 'age', ascending = False)
df

    name  age gender        job
3   paul   58      F    manager
5  julie   44      F  scientist
4  peter   33      M   engineer
1   john   26      M    student
2   eric   22      M    student
0  alice   19      F    student

In [88]:
df

    name  age gender        job
3   paul   58      F    manager
5  julie   44      F  scientist
4  peter   33      M   engineer
1   john   26      M    student
2   eric   22      M    student
0  alice   19      F    student

In [89]:
df.sort_values(by = 'age', ascending = False, inplace = True, ignore_index=True)
df

    name  age gender        job
0   paul   58      F    manager
1  julie   44      F  scientist
2  peter   33      M   engineer
3   john   26      M    student
4   eric   22      M    student
5  alice   19      F    student

In [90]:
users[pd.Series([name[0] for name in users.name.tolist()]) == 'p']

    name  age gender       job
3   paul   58      F   manager
4  peter   33      M  engineer

In [91]:
df = users.copy()
df.sort_values(by = ['job', 'age'], inplace = True)
df.index = range(0, df.shape[0])
df

    name  age gender        job
0  peter   33      M   engineer
1   paul   58      F    manager
2  julie   44      F  scientist
3  alice   19      F    student
4   eric   22      M    student
5   john   26      M    student

## **Unpivoting and Pivoting**

**Unpivot ->**  Wide format (Unstacked Format) to Long format (Stacked Format)<br>
**Pivot ->**    Long format (Stacked Format) to Wide format (Unstacked Format)

In [92]:
# performing the unpivot operation: Wide format to Long format
stacked = pd.melt(users, id_vars = "name", var_name = "variable", value_name = "value");
stacked

     name variable      value
0   alice      age         19
1    john      age         26
2    eric      age         22
3    paul      age         58
4   peter      age         33
5   julie      age         44
6   alice   gender          F
7    john   gender          M
8    eric   gender          M
9    paul   gender          F
10  peter   gender          M
11  julie   gender          F
12  alice      job    student
13   john      job    student
14   eric      job    student
15   paul      job    manager
16  peter      job   engineer
17  julie      job  scientist

In [93]:
unstacked = stacked.pivot(index = 'name', columns = "variable", values = "value");
unstacked

variable age gender        job
name
alice     19      F    student
eric      22      M    student
john      26      M    student
julie     44      F  scientist
paul      58      F    manager
peter     33      M   engineer

In [94]:
unstacked.reset_index(inplace=True)
unstacked.columns.name = ""
unstacked

    name age gender        job
0  alice  19      F    student
1   eric  22      M    student
2   john  26      M    student
3  julie  44      F  scientist
4   paul  58      F    manager
5  peter  33      M   engineer

## **Quality Control: Duplicate Data**

In [95]:
df = users.copy()
df

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [170]:
df = users.copy()
df = pd.concat([df, df.loc[[0]]])
df = pd.concat([df, df.loc[[2]]])
df = pd.concat([df, df.loc[[4]]])
df = pd.concat([df, df.loc[[0]]], ignore_index=True)
df.sort_values(by = "name", inplace = True, ignore_index=True)
df

     name  age gender        job
0   alice   19      F    student
1   alice   19      F    student
2   alice   19      F    student
3   alice   19      F    student
4    eric   22      M    student
5    eric   22      M    student
6    john   26      M    student
7   julie   44      F  scientist
8    paul   58      F    manager
9   peter   33      M   engineer
10  peter   33      M   engineer

In [169]:
df = users.copy()
df = pd.concat([df, df.loc[[0]]], ignore_index=True)
df

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist
    name  age gender      job
0  alice   19      F  student

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist
6  alice   19      F    student

In [119]:
print (df.duplicated())
print ((df.duplicated()).sum())

0    False
1     True
2    False
3     True
4    False
5    False
6    False
7     True
8    False
9     True
dtype: bool
4

In [120]:
print (~df.duplicated())
print ((~df.duplicated()).sum())

0     True
1    False
2     True
3    False
4     True
5     True
6     True
7    False
8     True
9    False
dtype: bool
6

In [99]:
df[~df.duplicated()]

    name  age gender        job
0  alice   19      F    student
2   eric   22      M    student
4   john   26      M    student
5  julie   44      F  scientist
6   paul   58      F    manager
8  peter   33      M   engineer

In [100]:
df.job.duplicated()

0    False
1     True
2     True
3     True
4     True
5    False
6    False
7     True
8    False
9     True
Name: job, dtype: bool

In [101]:
df[df.job.duplicated()]

    name  age gender       job
1  alice   19      F   student
2   eric   22      M   student
3   eric   22      M   student
4   john   26      M   student
7   paul   58      F   manager
9  peter   33      M  engineer

In [102]:
print (df.duplicated(['job', 'gender']).sum())
df.duplicated(['job', 'gender'])

5

0    False
1     True
2    False
3     True
4     True
5    False
6    False
7     True
8    False
9     True
dtype: bool

In [129]:
df.drop_duplicates(inplace = True)
df.index = range(0, df.shape[0])
df

    name  age gender        job
0  alice   19      F    student
1   eric   22      M    student
2   john   26      M    student
3  julie   44      F  scientist
4   paul   58      F    manager
5  peter   33      M   engineer

In [127]:
df

    name  age gender        job
0  alice   19      F    student
1   eric   22      M    student
2   john   26      M    student
3  julie   44      F  scientist
4   paul   58      F    manager
5  peter   33      M   engineer

In [128]:
range(0, df.shape[0])

range(0, 6)

## **Quality Control: Missing Data**

In [130]:
df = merge_left.copy()
df

    name  age gender        job  height
0  alice   19      F    student   165.0
1   john   26      M    student   180.0
2   eric   22      M    student   175.0
3   paul   58      F    manager     NaN
4  peter   33      M   engineer     NaN
5  julie   44      F  scientist   171.0

In [132]:
df.describe(include='all').T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
name,6,6,alice,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN
age,6.0,NaN,NaN,NaN,33.666667,14.895189,19.0,23.0,29.5,41.25,58.0
gender,6,2,F,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN
job,6,4,student,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN
height,4.0,NaN,NaN,NaN,172.75,6.344289,165.0,169.5,173.0,176.25,180.0

In [104]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   age     6 non-null      int64
 2   gender  6 non-null      object
 3   job     6 non-null      object
 4   height  4 non-null      float64
dtypes: float64(1), int64(1), object(3)
memory usage: 288.0+ bytes

In [105]:
print (df.height.isnull().sum())
print (df.height.isnull())
df[df.height.isnull()]

2
0    False
1    False
2    False
3     True
4     True
5    False
Name: height, dtype: bool

    name  age gender       job  height
3   paul   58      F   manager     NaN
4  peter   33      M  engineer     NaN

In [106]:
print (df.height.notnull().sum())
print (df.height.notnull())
df[df.height.notnull()]

4
0     True
1     True
2     True
3    False
4    False
5     True
Name: height, dtype: bool

    name  age gender        job  height
0  alice   19      F    student   165.0
1   john   26      M    student   180.0
2   eric   22      M    student   175.0
5  julie   44      F  scientist   171.0

In [107]:
df.isnull()

    name    age  gender    job  height
0  False  False   False  False   False
1  False  False   False  False   False
2  False  False   False  False   False
3  False  False   False  False    True
4  False  False   False  False    True
5  False  False   False  False   False

In [108]:
df.notnull()

   name   age  gender   job  height
0  True  True    True  True    True
1  True  True    True  True    True
2  True  True    True  True    True
3  True  True    True  True   False
4  True  True    True  True   False
5  True  True    True  True    True

In [109]:
# Strategy - 1: (Deleting rows containing missing values)
df = merge_outer.copy()
df.dropna(inplace = True)    # delete that row which is having null value in any column
df

    name   age gender        job  height
0  alice  19.0      F    student   165.0
1   john  26.0      M    student   180.0
2   eric  22.0      M    student   175.0
5  julie  44.0      F  scientist   171.0

In [133]:
df = merge_outer.copy()
df.dropna(how = "all", inplace = True)   # delete that row which is having null value in all columns
df

    name   age gender        job  height
0  alice  19.0      F    student   165.0
1   john  26.0      M    student   180.0
2   eric  22.0      M    student   175.0
3   paul  58.0      F    manager     NaN
4  peter  33.0      M   engineer     NaN
5  julie  44.0      F  scientist   171.0
6  cathy   NaN    NaN        NaN   169.0

In [134]:
# Strategy - 2: (Filling up missing values)
df = merge_outer.copy()
df.fillna(0, inplace = True)    # filling with 0 value
df

    name   age gender        job  height
0  alice  19.0      F    student   165.0
1   john  26.0      M    student   180.0
2   eric  22.0      M    student   175.0
3   paul  58.0      F    manager     0.0
4  peter  33.0      M   engineer     0.0
5  julie  44.0      F  scientist   171.0
6  cathy   0.0      0          0   169.0

In [136]:
df = merge_outer.copy()
mean_height = df.height.mean()
print (mean_height)
df.fillna(mean_height, inplace = True)    # filling with mean value of the column
df

172.0

    name    age gender        job  height
0  alice   19.0      F    student   165.0
1   john   26.0      M    student   180.0
2   eric   22.0      M    student   175.0
3   paul   58.0      F    manager   172.0
4  peter   33.0      M   engineer   172.0
5  julie   44.0      F  scientist   171.0
6  cathy  172.0  172.0      172.0   169.0

In [113]:
df = merge_outer.copy()
df

    name   age gender        job  height
0  alice  19.0      F    student   165.0
1   john  26.0      M    student   180.0
2   eric  22.0      M    student   175.0
3   paul  58.0      F    manager     NaN
4  peter  33.0      M   engineer     NaN
5  julie  44.0      F  scientist   171.0
6  cathy   NaN    NaN        NaN   169.0

In [138]:
df = merge_outer.copy()
df.sort_values(by = 'age', inplace = True, ignore_index=True)
df

    name   age gender        job  height
0  alice  19.0      F    student   165.0
1   eric  22.0      M    student   175.0
2   john  26.0      M    student   180.0
3  peter  33.0      M   engineer     NaN
4  julie  44.0      F  scientist   171.0
5   paul  58.0      F    manager     NaN
6  cathy   NaN    NaN        NaN   169.0

In [139]:
df.fillna(method = 'pad', inplace = True)    # forward fill
df

    name   age gender        job  height
0  alice  19.0      F    student   165.0
1   eric  22.0      M    student   175.0
2   john  26.0      M    student   180.0
3  peter  33.0      M   engineer   180.0
4  julie  44.0      F  scientist   171.0
5   paul  58.0      F    manager   171.0
6  cathy  58.0      F    manager   169.0

In [141]:
df = merge_outer.copy()
df

    name   age gender        job  height
0  alice  19.0      F    student   165.0
1   john  26.0      M    student   180.0
2   eric  22.0      M    student   175.0
3   paul  58.0      F    manager     NaN
4  peter  33.0      M   engineer     NaN
5  julie  44.0      F  scientist   171.0
6  cathy   NaN    NaN        NaN   169.0

In [143]:
df.sort_values(by = 'age', inplace = True)
df

    name   age gender        job  height
0  alice  19.0      F    student   165.0
2   eric  22.0      M    student   175.0
1   john  26.0      M    student   180.0
4  peter  33.0      M   engineer     NaN
5  julie  44.0      F  scientist   171.0
3   paul  58.0      F    manager     NaN
6  cathy   NaN    NaN        NaN   169.0

In [144]:
df.fillna(method = 'bfill', inplace = True)    # backward fill
df

    name   age gender        job  height
0  alice  19.0      F    student   165.0
2   eric  22.0      M    student   175.0
1   john  26.0      M    student   180.0
4  peter  33.0      M   engineer   171.0
5  julie  44.0      F  scientist   171.0
3   paul  58.0      F    manager   169.0
6  cathy   NaN    NaN        NaN   169.0